In [1]:
'/Users/jared/.pyenv/versions/3.11.0/bin/python -m pip install ipykernel -U --force-reinstall'

'/Users/jared/.pyenv/versions/3.11.0/bin/python -m pip install ipykernel -U --force-reinstall'

In [4]:
pip install pandas

Requirement already satisfied: pandas in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip available: 22.3 -> 23.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

In [6]:
import numpy as np

In [7]:
dummy_dataframe = pd.DataFrame({'col1':[1,2,3,4], 'col2':[8,7,9,6]})

In [8]:
dummy_dataframe

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [9]:
dummy_series = pd.Series([1,7,8,9,6])

In [10]:
type(dummy_dataframe)

pandas.core.frame.DataFrame

In [11]:
type(dummy_dataframe['col1'])

pandas.core.series.Series

In [12]:
new_list = dummy_dataframe['col1'].to_list()

In [13]:
new_list.extend([5,4,7,8])

In [14]:
updated_dataframe = pd.concat([pd.Series(new_list),dummy_dataframe['col2']], axis=1)

In [15]:
updated_dataframe.columns = ['col1','col2']

In [16]:
updated_dataframe

   col1  col2
0     1   8.0
1     2   7.0
2     3   9.0
3     4   6.0
4     5   NaN
5     4   NaN
6     7   NaN
7     8   NaN

In [17]:
dummy_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
dtypes: int64(2)
memory usage: 192.0 bytes

In [18]:
updated_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    8 non-null      int64
 1   col2    4 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 256.0 bytes

In [20]:
dummy_dataframe.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
dummy_dataframe.columns

Index(['col1', 'col2'], dtype='object')

In [23]:
dummy_dataframe.axes

[RangeIndex(start=0, stop=4, step=1), Index(['col1', 'col2'], dtype='object')]

In [24]:
dummy_dataframe.head()

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [25]:
dummy_dataframe.tail()

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [26]:
dummy_dataframe.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  7.500000
std    1.290994  1.290994
min    1.000000  6.000000
25%    1.750000  6.750000
50%    2.500000  7.500000
75%    3.250000  8.250000
max    4.000000  9.000000

In [27]:
#isolating a specific column
dummy_dataframe.col1

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [28]:
dummy_dataframe['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [34]:
#iloc/loc function helps to isolate the row
#iloc = index location value of the index
#loc = location of the actual value
dummy_dataframe.iloc[2].loc['col1']

3

In [30]:
dummy_dataframe

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [36]:
dummy_dataframe.index = ['val1','val2','val3','val4']

In [37]:
dummy_dataframe

      col1  col2
val1     1     8
val2     2     7
val3     3     9
val4     4     6

In [41]:
dummy_dataframe.iloc[0].loc['col2']

8

In [40]:
dummy_dataframe.loc['val1']

col1    1
col2    8
Name: val1, dtype: int64

In [42]:
dummy_dataframe.iloc[1,1]

7

In [44]:
dummy_dataframe.iloc[0:2,1] #slicing a range of rows , and the column in position 1 (second position) #slicing gives u row and column name separated by "," so A,B is row A and column B

val1    8
val2    7
Name: col2, dtype: int64

In [45]:
dummy_dataframe.loc[['val1','val3'],['col1','col2']] #slicing selected rows/columns - we need to pass a list of conditions, thus 2 sets of brackets

      col1  col2
val1     1     8
val3     3     9

In [46]:
dummy_dataframe.iloc[[0,2],[0,1]] #same as above, but this is slicing based on position

      col1  col2
val1     1     8
val3     3     9

In [48]:
#Can also copy the raw link (From github go to raw then in url then just paste the link in the '')
orders=pd.read_csv('customer_orders.csv')

In [49]:
orders

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [50]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_date       14 non-null     object
 1   customer_id      14 non-null     int64
 2   name             14 non-null     object
 3   email            12 non-null     object
 4   product_id       14 non-null     int64
 5   brand            14 non-null     object
 6   next_action      0 non-null      float64
 7   delivery_date    0 non-null      float64
 8   delivery_route   0 non-null      float64
 9   account_manager  0 non-null      float64
dtypes: float64(4), int64(2), object(4)
memory usage: 1.2+ KB

In [51]:
orders.head()

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN

In [55]:
orders.tail()

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [57]:
orders[['order_date','name']] # Isolate specific columns

    order_date            name
0   2022-01-01      John Adams
1   2022-01-02     Jorden Haas
2   2022-01-03      John Adams
3   2022-01-04     Jorden Haas
4   2022-01-05   Pierce Glover
5   2022-01-06      John Adams
6   2022-01-07     Jorden Haas
7   2022-01-08   Pierce Glover
8   2022-01-09  Carly Copeland
9   2022-01-10     Jorden Haas
10  2022-01-11   Pierce Glover
11  2022-01-12  Carly Copeland
12  2022-01-13   Pierce Glover
13  2022-01-14  Carly Copeland

In [60]:
orders.iloc[[10,13]]

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [61]:
#Note that set index is not a inplace change so it is a temporary change. Usually we use this to basically index a certain column and then assign it to a variable etc

orders.set_index('customer_id').loc[1001]

,order_date,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
customer_id,,,,,,,,,
1001,2022-01-01,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
1001,2022-01-03,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
1001,2022-01-06,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN

In [62]:
orders.reset_index() #inplace is false. Can set it permanently if want

,index,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
1,1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
2,2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
3,3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
7,7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
8,8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
9,9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
10,10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
11,11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
13,13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [64]:
#usually to reset index first and then set index
orders.reset_index().set_index('name')

,index,order_date,customer_id,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
name,,,,,,,,,,
John Adams,0,2022-01-01,1001,john@email.com,12,ABC,NaN,NaN,NaN,NaN
Jorden Haas,1,2022-01-02,1002,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
John Adams,2,2022-01-03,1001,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
Jorden Haas,3,2022-01-04,1002,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
Pierce Glover,4,2022-01-05,1003,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
John Adams,5,2022-01-06,1001,john@email.com,14,ABC,NaN,NaN,NaN,NaN
Jorden Haas,6,2022-01-07,1002,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
Pierce Glover,7,2022-01-08,1003,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
Carly Copeland,8,2022-01-09,1004,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
Jorden Haas,9,2022-01-10,1002,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
Pierce Glover,10,2022-01-11,1003,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
Carly Copeland,11,2022-01-12,1004,NaN,15,DT,NaN,NaN,NaN,NaN
Pierce Glover,12,2022-01-13,1003,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
Carly Copeland,13,2022-01-14,1004,NaN,15,DT,NaN,NaN,NaN,NaN

In [66]:
orders.sort_index()  #By default is smallest to largest

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [67]:
orders.sort_index(ascending=False) #Also has inplace argument can set if want

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN

In [71]:
orders.reset_index().set_index('order_date').sort_index(ascending=False).head(5)
#Gives u last 5 record

,index,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
order_date,,,,,,,,,,
2022-01-14,13,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
2022-01-13,12,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
2022-01-12,11,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
2022-01-11,10,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
2022-01-10,9,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN

In [72]:
list_dates = ['1-1-2022','1-2-2022','1-14-2022']

In [73]:
sorted(list_dates)

['1-1-2022', '1-14-2022', '1-2-2022']

In [78]:
orders['order_date'] = orders['order_date'].astype('datetime64[ns]')

In [76]:
orders

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [79]:
orders['order_date'] = pd.to_datetime(orders['order_date'])

In [80]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_date       14 non-null     datetime64[ns]
 1   customer_id      14 non-null     int64
 2   name             14 non-null     object
 3   email            12 non-null     object
 4   product_id       14 non-null     int64
 5   brand            14 non-null     object
 6   next_action      0 non-null      float64
 7   delivery_date    0 non-null      float64
 8   delivery_route   0 non-null      float64
 9   account_manager  0 non-null      float64
dtypes: datetime64[ns](1), float64(4), int64(2), object(3)
memory usage: 1.2+ KB

In [81]:
orders[orders['brand'] == 'ABC']

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN

In [82]:
orders[orders['product_id'] >12 ]

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN
2,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [84]:
orders[(orders['brand'] == 'ABC') & (orders['order_date'] < '2022-01-08 00:00:00')]

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN

In [85]:
orders[orders['brand'].isin(['ABC','DT'])] # Use the isin() function for a list of conditions in the same column

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN
3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
5,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN
6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN
8,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN
9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN
11,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN
12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN

In [87]:
account_mgr = pd.read_csv('account_managers.csv')

In [88]:
account_mgr

    brand account_manager
0     ABC          Johnny
1  Brand2           Timmy
2      DT           Sammy

In [90]:
#There are two ways to connect 2 dataframe they are join() and merge()

In [91]:
merged_data=pd.merge(left = orders , right = account_mgr, left_on='brand', right_on='brand')

In [92]:
merged_data

,order_date,customer_id,name,email,product_id,brand,next_action,delivery_date,delivery_route,account_manager_x,account_manager_y
0,2022-01-01,1001,John Adams,john@email.com,12,ABC,NaN,NaN,NaN,NaN,Johnny
1,2022-01-04,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN,Johnny
2,2022-01-05,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN,Johnny
3,2022-01-06,1001,John Adams,john@email.com,14,ABC,NaN,NaN,NaN,NaN,Johnny
4,2022-01-07,1002,Jorden Haas,jorden@email.com,14,ABC,NaN,NaN,NaN,NaN,Johnny
5,2022-01-09,1004,Carly Copeland,carly@email.com,12,ABC,NaN,NaN,NaN,NaN,Johnny
6,2022-01-10,1002,Jorden Haas,jorden@email.com,12,ABC,NaN,NaN,NaN,NaN,Johnny
7,2022-01-13,1003,Pierce Glover,pierce@email.com,12,ABC,NaN,NaN,NaN,NaN,Johnny
8,2022-01-02,1002,Jorden Haas,jorden@email.com,13,Brand2,NaN,NaN,NaN,NaN,Timmy
9,2022-01-03,1001,John Adams,john@email.com,13,Brand2,NaN,NaN,NaN,NaN,Timmy
10,2022-01-08,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN,Timmy
11,2022-01-11,1003,Pierce Glover,pierce@email.com,13,Brand2,NaN,NaN,NaN,NaN,Timmy
12,2022-01-12,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN,Sammy
13,2022-01-14,1004,Carly Copeland,NaN,15,DT,NaN,NaN,NaN,NaN,Sammy

In [95]:
account_mgr.set_index('brand',inplace=True) #Set permanently for the brand column to be indexed
joined_data = orders.set_index('brand').join(account_mgr, rsuffix='_x') #suffix basically add a suffix to the column name because otherwise the will have column with same name

In [96]:
joined_data

,order_date,customer_id,name,email,product_id,next_action,delivery_date,delivery_route,account_manager,account_manager_x
brand,,,,,,,,,,
ABC,2022-01-01,1001,John Adams,john@email.com,12,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-04,1002,Jorden Haas,jorden@email.com,14,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-05,1003,Pierce Glover,pierce@email.com,12,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-06,1001,John Adams,john@email.com,14,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-07,1002,Jorden Haas,jorden@email.com,14,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-09,1004,Carly Copeland,carly@email.com,12,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-10,1002,Jorden Haas,jorden@email.com,12,NaN,NaN,NaN,NaN,Johnny
ABC,2022-01-13,1003,Pierce Glover,pierce@email.com,12,NaN,NaN,NaN,NaN,Johnny
Brand2,2022-01-02,1002,Jorden Haas,jorden@email.com,13,NaN,NaN,NaN,NaN,Timmy
Brand2,2022-01-03,1001,John Adams,john@email.com,13,NaN,NaN,NaN,NaN,Timmy
Brand2,2022-01-08,1003,Pierce Glover,pierce@email.com,13,NaN,NaN,NaN,NaN,Timmy
Brand2,2022-01-11,1003,Pierce Glover,pierce@email.com,13,NaN,NaN,NaN,NaN,Timmy
DT,2022-01-12,1004,Carly Copeland,NaN,15,NaN,NaN,NaN,NaN,Sammy
DT,2022-01-14,1004,Carly Copeland,NaN,15,NaN,NaN,NaN,NaN,Sammy

In [98]:
#if do not want to specify the rsuffix, can specify drop first then join. Should work
joined_data_v2 = orders.reset_index().set_index('brand').drop('account_manager',axis=1).join(account_mgr)

In [99]:
joined_data_v2

,index,order_date,customer_id,name,email,product_id,next_action,delivery_date,delivery_route,account_manager
brand,,,,,,,,,,
ABC,0,2022-01-01,1001,John Adams,john@email.com,12,NaN,NaN,NaN,Johnny
ABC,3,2022-01-04,1002,Jorden Haas,jorden@email.com,14,NaN,NaN,NaN,Johnny
ABC,4,2022-01-05,1003,Pierce Glover,pierce@email.com,12,NaN,NaN,NaN,Johnny
ABC,5,2022-01-06,1001,John Adams,john@email.com,14,NaN,NaN,NaN,Johnny
ABC,6,2022-01-07,1002,Jorden Haas,jorden@email.com,14,NaN,NaN,NaN,Johnny
ABC,8,2022-01-09,1004,Carly Copeland,carly@email.com,12,NaN,NaN,NaN,Johnny
ABC,9,2022-01-10,1002,Jorden Haas,jorden@email.com,12,NaN,NaN,NaN,Johnny
ABC,12,2022-01-13,1003,Pierce Glover,pierce@email.com,12,NaN,NaN,NaN,Johnny
Brand2,1,2022-01-02,1002,Jorden Haas,jorden@email.com,13,NaN,NaN,NaN,Timmy
Brand2,2,2022-01-03,1001,John Adams,john@email.com,13,NaN,NaN,NaN,Timmy
Brand2,7,2022-01-08,1003,Pierce Glover,pierce@email.com,13,NaN,NaN,NaN,Timmy
Brand2,10,2022-01-11,1003,Pierce Glover,pierce@email.com,13,NaN,NaN,NaN,Timmy
DT,11,2022-01-12,1004,Carly Copeland,NaN,15,NaN,NaN,NaN,Sammy
DT,13,2022-01-14,1004,Carly Copeland,NaN,15,NaN,NaN,NaN,Sammy